clear all; clc;
% Значения коэффициентов
b0  =  0.8; 
b1  =  1.3; 
b11 = -6.1;
b12 = -0.6;
b2  =  1.7;
b22 = -1.7;
g = 0.05; % постоянная шага
d = 0.01; % дельта
% Начальная точка
x1 = -9; 
x2 =  8; 
k = 1;  % Счетчик шагов
kmax = 100; % Предельное число шагов, 
% задается для предотвращения зацикливания
% Массивы для хранения промежуточных координат
x1trace = [x1]; 
x2trace = [x2]; 
i = 2; 
while k < kmax 
% Спуск по обеим координатам сразу
gr1 = b1 + b12*x2 + 2*b11*x1; 
gr2 = b2 + b12*x1 + 2*b22*x2; 
x1 = x1 + g*gr1; 
x2 = x2 + g*gr2; 
% Сохранение координат
x1trace(i) = x1; 
x2trace(i) = x2; 
i = i + 1; 
% Проверка условия останова
if sqrt(gr1^2 + gr2^2) <= d; 
break; % Выход из цикла в случае выполнения условия
end
k = k + 1; 
end
% Построение графика
x = -10:0.1:10; 
y = -10:0.1:10; 
[X, Y] = meshgrid(x, y); 
Z = b0 + b1*X + b2*Y + b12*X.*Y + b11*X.^2 + b22*Y.^2; 
[C, h] = contour(X, Y, Z); 
clabel(C, h);  % Отображение меток на линиях уровня
hold on; 
plot(x1trace, x2trace, '-x'); 
% Вывод начальной точки на график
text(x1trace(1) + 0.2, x2trace(1) + 0.5, 'M0'); 
% Вывод решения на график
text(x1 + 2, x2, ...
strvcat(['x1 = ' (num2str(x1))], ...
        ['x2 = ' (num2str(x2))], ...
        ['k = '  (num2str(k))]));